; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 155)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 149)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 127)
	(= (data Star5 spectrograph2) 185)
	(= (data Planet6 spectrograph2) 296)
	(= (data Star7 spectrograph2) 185)
	(= (data Phenomenon8 spectrograph2) 97)
	(= (data Phenomenon9 spectrograph2) 71)
	(= (data Phenomenon10 spectrograph2) 98)
	(= (data Phenomenon11 spectrograph2) 94)
	(= (data Star5 thermograph0) 87)
	(= (data Planet6 thermograph0) 167)
	(= (data Star7 thermograph0) 233)
	(= (data Phenomenon8 thermograph0) 76)
	(= (data Phenomenon9 thermograph0) 58)
	(= (data Phenomenon10 thermograph0) 36)
	(= (data Phenomenon11 thermograph0) 186)
	(= (data Star5 spectrograph1) 210)
	(= (data Planet6 spectrograph1) 62)
	(= (data Star7 spectrograph1) 139)
	(= (data Phenomenon8 spectrograph1) 124)
	(= (data Phenomenon9 spectrograph1) 292)
	(= (data Phenomenon10 spectrograph1) 76)
	(= (data Phenomenon11 spectrograph1) 156)
	(= (data Star5 spectrograph3) 244)
	(= (data Planet6 spectrograph3) 25)
	(= (data Star7 spectrograph3) 181)
	(= (data Phenomenon8 spectrograph3) 92)
	(= (data Phenomenon9 spectrograph3) 159)
	(= (data Phenomenon10 spectrograph3) 94)
	(= (data Phenomenon11 spectrograph3) 284)
	(= (slew_time GroundStation4 GroundStation0) 21.22)
	(= (slew_time GroundStation0 GroundStation4) 21.22)
	(= (slew_time GroundStation4 GroundStation1) 19.9)
	(= (slew_time GroundStation1 GroundStation4) 19.9)
	(= (slew_time GroundStation4 GroundStation2) 28.78)
	(= (slew_time GroundStation2 GroundStation4) 28.78)
	(= (slew_time GroundStation4 GroundStation3) 20.41)
	(= (slew_time GroundStation3 GroundStation4) 20.41)
	(= (slew_time GroundStation3 GroundStation0) 38.54)
	(= (slew_time GroundStation0 GroundStation3) 38.54)
	(= (slew_time GroundStation3 GroundStation1) 13.66)
	(= (slew_time GroundStation1 GroundStation3) 13.66)
	(= (slew_time GroundStation3 GroundStation2) 53.88)
	(= (slew_time GroundStation2 GroundStation3) 53.88)
	(= (slew_time GroundStation1 GroundStation0) 58.54)
	(= (slew_time GroundStation0 GroundStation1) 58.54)
	(= (slew_time GroundStation2 GroundStation0) 27.22)
	(= (slew_time GroundStation0 GroundStation2) 27.22)
	(= (slew_time GroundStation2 GroundStation1) 45.65)
	(= (slew_time GroundStation1 GroundStation2) 45.65)
	(= (slew_time Star5 GroundStation0) 19.58)
	(= (slew_time GroundStation0 Star5) 19.58)
	(= (slew_time Star5 GroundStation1) 5.16)
	(= (slew_time GroundStation1 Star5) 5.16)
	(= (slew_time Star5 GroundStation2) 57.23)
	(= (slew_time GroundStation2 Star5) 57.23)
	(= (slew_time Star5 GroundStation3) 18.63)
	(= (slew_time GroundStation3 Star5) 18.63)
	(= (slew_time Star5 GroundStation4) 48.25)
	(= (slew_time GroundStation4 Star5) 48.25)
	(= (slew_time Planet6 GroundStation0) 44.28)
	(= (slew_time GroundStation0 Planet6) 44.28)
	(= (slew_time Planet6 GroundStation1) 59.64)
	(= (slew_time GroundStation1 Planet6) 59.64)
	(= (slew_time Planet6 GroundStation2) 12.98)
	(= (slew_time GroundStation2 Planet6) 12.98)
	(= (slew_time Planet6 GroundStation3) 36.46)
	(= (slew_time GroundStation3 Planet6) 36.46)
	(= (slew_time Planet6 GroundStation4) 32.22)
	(= (slew_time GroundStation4 Planet6) 32.22)
	(= (slew_time Planet6 Star5) 14.26)
	(= (slew_time Star5 Planet6) 14.26)
	(= (slew_time Star7 GroundStation0) 37.5)
	(= (slew_time GroundStation0 Star7) 37.5)
	(= (slew_time Star7 GroundStation1) 9.041)
	(= (slew_time GroundStation1 Star7) 9.041)
	(= (slew_time Star7 GroundStation2) 23.52)
	(= (slew_time GroundStation2 Star7) 23.52)
	(= (slew_time Star7 GroundStation3) 38.76)
	(= (slew_time GroundStation3 Star7) 38.76)
	(= (slew_time Star7 GroundStation4) 35.96)
	(= (slew_time GroundStation4 Star7) 35.96)
	(= (slew_time Star7 Star5) 8.598)
	(= (slew_time Star5 Star7) 8.598)
	(= (slew_time Star7 Planet6) 46.72)
	(= (slew_time Planet6 Star7) 46.72)
	(= (slew_time Phenomenon8 GroundStation0) 6.346)
	(= (slew_time GroundStation0 Phenomenon8) 6.346)
	(= (slew_time Phenomenon8 GroundStation1) 16.52)
	(= (slew_time GroundStation1 Phenomenon8) 16.52)
	(= (slew_time Phenomenon8 GroundStation2) 2.741)
	(= (slew_time GroundStation2 Phenomenon8) 2.741)
	(= (slew_time Phenomenon8 GroundStation3) 79.88)
	(= (slew_time GroundStation3 Phenomenon8) 79.88)
	(= (slew_time Phenomenon8 GroundStation4) 64.65)
	(= (slew_time GroundStation4 Phenomenon8) 64.65)
	(= (slew_time Phenomenon8 Star5) 31.85)
	(= (slew_time Star5 Phenomenon8) 31.85)
	(= (slew_time Phenomenon8 Planet6) 2.126)
	(= (slew_time Planet6 Phenomenon8) 2.126)
	(= (slew_time Phenomenon8 Star7) 0.2062)
	(= (slew_time Star7 Phenomenon8) 0.2062)
	(= (slew_time Phenomenon9 GroundStation0) 24.75)
	(= (slew_time GroundStation0 Phenomenon9) 24.75)
	(= (slew_time Phenomenon9 GroundStation1) 6.882)
	(= (slew_time GroundStation1 Phenomenon9) 6.882)
	(= (slew_time Phenomenon9 GroundStation2) 38.61)
	(= (slew_time GroundStation2 Phenomenon9) 38.61)
	(= (slew_time Phenomenon9 GroundStation3) 24.17)
	(= (slew_time GroundStation3 Phenomenon9) 24.17)
	(= (slew_time Phenomenon9 GroundStation4) 6.438)
	(= (slew_time GroundStation4 Phenomenon9) 6.438)
	(= (slew_time Phenomenon9 Star5) 90.41)
	(= (slew_time Star5 Phenomenon9) 90.41)
	(= (slew_time Phenomenon9 Planet6) 73.62)
	(= (slew_time Planet6 Phenomenon9) 73.62)
	(= (slew_time Phenomenon9 Star7) 10.52)
	(= (slew_time Star7 Phenomenon9) 10.52)
	(= (slew_time Phenomenon9 Phenomenon8) 12.33)
	(= (slew_time Phenomenon8 Phenomenon9) 12.33)
	(= (slew_time Phenomenon10 GroundStation0) 26.35)
	(= (slew_time GroundStation0 Phenomenon10) 26.35)
	(= (slew_time Phenomenon10 GroundStation1) 86.9)
	(= (slew_time GroundStation1 Phenomenon10) 86.9)
	(= (slew_time Phenomenon10 GroundStation2) 74.92)
	(= (slew_time GroundStation2 Phenomenon10) 74.92)
	(= (slew_time Phenomenon10 GroundStation3) 18.05)
	(= (slew_time GroundStation3 Phenomenon10) 18.05)
	(= (slew_time Phenomenon10 GroundStation4) 68.99)
	(= (slew_time GroundStation4 Phenomenon10) 68.99)
	(= (slew_time Phenomenon10 Star5) 37.74)
	(= (slew_time Star5 Phenomenon10) 37.74)
	(= (slew_time Phenomenon10 Planet6) 47.18)
	(= (slew_time Planet6 Phenomenon10) 47.18)
	(= (slew_time Phenomenon10 Star7) 0.8015)
	(= (slew_time Star7 Phenomenon10) 0.8015)
	(= (slew_time Phenomenon10 Phenomenon8) 52.13)
	(= (slew_time Phenomenon8 Phenomenon10) 52.13)
	(= (slew_time Phenomenon10 Phenomenon9) 13.53)
	(= (slew_time Phenomenon9 Phenomenon10) 13.53)
	(= (slew_time Phenomenon11 GroundStation0) 33.69)
	(= (slew_time GroundStation0 Phenomenon11) 33.69)
	(= (slew_time Phenomenon11 GroundStation1) 13.15)
	(= (slew_time GroundStation1 Phenomenon11) 13.15)
	(= (slew_time Phenomenon11 GroundStation2) 73.46)
	(= (slew_time GroundStation2 Phenomenon11) 73.46)
	(= (slew_time Phenomenon11 GroundStation3) 79.38)
	(= (slew_time GroundStation3 Phenomenon11) 79.38)
	(= (slew_time Phenomenon11 GroundStation4) 35.89)
	(= (slew_time GroundStation4 Phenomenon11) 35.89)
	(= (slew_time Phenomenon11 Star5) 30.5)
	(= (slew_time Star5 Phenomenon11) 30.5)
	(= (slew_time Phenomenon11 Planet6) 23.13)
	(= (slew_time Planet6 Phenomenon11) 23.13)
	(= (slew_time Phenomenon11 Star7) 1.97)
	(= (slew_time Star7 Phenomenon11) 1.97)
	(= (slew_time Phenomenon11 Phenomenon8) 12.42)
	(= (slew_time Phenomenon8 Phenomenon11) 12.42)
	(= (slew_time Phenomenon11 Phenomenon9) 19.19)
	(= (slew_time Phenomenon9 Phenomenon11) 19.19)
	(= (slew_time Phenomenon11 Phenomenon10) 26.01)
	(= (slew_time Phenomenon10 Phenomenon11) 26.01)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite2 Planet6)
	(have_image Star5 spectrograph3)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph3)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 149 to 129.1, (fuel-used) from 0 to 19.9
   goals met: 1 of 8
2. (turn_to satellite2 groundstation1 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 127 to 107.1, (fuel-used) from 19.9 to 39.8
   goals met: 1 of 8
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
5. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon9)
   changed: (fuel satellite2) from 107.1 to 100.218, (fuel-used) from 39.8 to 46.682
   goals met: 1 of 8
7. (turn_to satellite1 star5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 129.1 to 123.94, (fuel-used) from 46.682 to 51.842
   goals met: 0 of 8
8. (take_image satellite2 phenomenon9 instrument4 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   changed: (data_capacity satellite2) from 1000 to 708, (data-stored) from 0 to 292
   goals met: 1 of 8
9. (turn_to satellite2 phenomenon8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 100.218 to 87.888, (fuel-used) from 51.842 to 64.172
   goals met: 1 of 8
10. (turn_to satellite2 phenomenon10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon10)
   changed: (fuel satellite2) from 87.888 to 35.758, (fuel-used) from 64.172 to 116.302
   goals met: 1 of 8
11. (take_image satellite2 phenomenon10 instrument4 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   changed: (data_capacity satellite2) from 708 to 672, (data-stored) from 292 to 328
   goals met: 2 of 8
12. (turn_to satellite2 star7 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 35.758 to 34.9565, (fuel-used) from 116.302 to 117.103
   goals met: 2 of 8
13. (take_image satellite2 star7 instrument4 spectrograph3)
   added: (have_image star7 spectrograph3)
   changed: (data_capacity satellite2) from 672 to 491, (data-stored) from 328 to 509
   goals met: 3 of 8
14. (turn_to satellite2 phenomenon8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 34.9565 to 34.7503, (fuel-used) from 117.103 to 117.31
   goals met: 3 of 8
15. (turn_to satellite2 planet6 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 34.7503 to 32.6243, (fuel-used) from 117.31 to 119.436
   goals met: 4 of 8
16. (turn_to satellite1 groundstation1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 123.94 to 118.78, (fuel-used) from 119.436 to 124.596
   goals met: 5 of 8
17. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 5 of 8
18. (turn_to satellite1 star5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 118.78 to 113.62, (fuel-used) from 124.596 to 129.756
   goals met: 4 of 8
19. (take_image satellite1 star5 instrument2 spectrograph3)
   added: (have_image star5 spectrograph3)
   changed: (data_capacity satellite1) from 1000 to 756, (data-stored) from 509 to 753
   goals met: 5 of 8
20. (turn_to satellite1 phenomenon11 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon11)
   changed: (fuel satellite1) from 113.62 to 83.12, (fuel-used) from 129.756 to 160.256
   goals met: 5 of 8
21. (take_image satellite1 phenomenon11 instrument2 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   changed: (data_capacity satellite1) from 756 to 662, (data-stored) from 753 to 847
   goals met: 6 of 8
22. (turn_to satellite1 planet6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 83.12 to 59.99, (fuel-used) from 160.256 to 183.386
   goals met: 6 of 8
23. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   changed: (data_capacity satellite1) from 662 to 366, (data-stored) from 847 to 1143
   goals met: 7 of 8
24. (turn_to satellite1 groundstation1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 59.99 to 0.35, (fuel-used) from 183.386 to 243.026
   goals met: 8 of 8
